from aiogram import Router, F
from aiogram.filters import CommandStart, Command
from aiogram.types import Message
import keyboard.inline_keyboard as inkb

start_router = Router()

@start_router.message(CommandStart())
async def cmd_start(message: Message):
    await message.answer(
        "Приветствуем в PCPenza! 🎉\n\n"
        "Мы — команда энтузиастов, которая уже год помогает собрать идеальный ПК под ваши задачи. "
        "У нас вы найдете подборку комплектующих под любой бюджет и цель — от комфортной работы до топового гейминга.\n\n"
        "💻 Что мы можем для вас сделать:\n"
        "- Подобрать комплектующие под ваши задачи и бюджет\n"
        "- Собрать ПК «под ключ» с гарантией качества\n"
        "- Консультации по апгрейду и оптимизации вашего компьютера\n\n"
        "Нажмите «Собрать мой ПК» ниже, чтобы начать заявку. Наш бот поможет вам шаг за шагом подобрать идеальные комплектующие, "
        "а наша команда — собрать всё максимально быстро и надежно!\n\n"
        "PCPenza — ваш путь к мощному ПК без лишней головной боли. 🚀",reply_markup=inkb.startKeyboard
    )

@start_router.message(Command('start_2'))
async def cmd_start_2(message: Message):
    await message.answer('Запуск сообщения по команде /start_2 используя фильтр Command()')

@start_router.message(F.text == '/start_3')
async def cmd_start_3(message: Message):
    await message.answer('Запуск сообщения по команде /start_3 используя магический фильтр F.text!')